In [1]:
import sqlite3
conn = sqlite3.connect('Employees.db')
print("Opened database successfully");

Opened database successfully

In [2]:
# Table 1 Query:
conn.execute('''Create Table EmployeeDetails(
EmployeeID int, 
FirstName varchar(50), 
LastName varchar(50), 
Age int, 
Gender varchar(50)
);''')
conn.commit()

In [3]:
#Table 2 Query:
conn.execute('''Create Table EmployeeSalary(
EmployeeID int, 
JobTitle varchar(50), 
Salary int
);''')
conn.commit()

In [4]:
# Table 1 Insertion Query:
conn.execute('''Insert into EmployeeDetails VALUES
(1001, 'Jim', 'Halpert', 30, 'Male'),
(1002, 'Pam', 'Beasley', 30, 'Female'),
(1003, 'Dwight', 'Schrute', 29, 'Male'),
(1004, 'Angela', 'Martin', 31, 'Female'),
(1005, 'Toby', 'Flenderson', 32, 'Male'),
(1006, 'Michael', 'Scott', 35, 'Male'),
(1007, 'Meredith', 'Palmer', 32, 'Female'),
(1008, 'Stanley', 'Hudson', 38, 'Male'),
(1009, 'Kevin', 'Malone', 31, 'Male');''')
conn.commit()

In [5]:
# Table 2 Insertion Query:
conn.execute('''Insert Into EmployeeSalary VALUES
(1001, 'Salesman', 45000),
(1002, 'Receptionist', 36000),
(1003, 'Salesman', 63000),
(1004, 'Accountant', 47000),
(1005, 'HR', 50000),
(1006, 'Regional Manager', 65000),
(1007, 'Supplier Relations', 41000),
(1008, 'Salesman', 48000),
(1009, 'Accountant', 42000);''')
conn.commit()

```
GROUP BY Query

In [8]:
groupby_Gender=conn.execute('''select Gender,Count(Gender) from EmployeeDetails group by Gender;''')
for i in groupby_Gender:
  print(i)

('Female', 3)
('Male', 6)

In [10]:
groupby_JobTitle=conn.execute('''select JobTitle,count(JobTitle) from EmployeeSalary group by JobTitle;''')
for i in groupby_JobTitle:
  print(i)

('Accountant', 2)
('HR', 1)
('Receptionist', 1)
('Regional Manager', 1)
('Salesman', 3)
('Supplier Relations', 1)

In [11]:
groupby_Gender_Age=conn.execute('''select Gender,Count(Gender),Age from EmployeeDetails group by Gender,Age;''')
for i in groupby_Gender_Age:
  print(i)

('Female', 1, 30)
('Female', 1, 31)
('Female', 1, 32)
('Male', 1, 29)
('Male', 1, 30)
('Male', 1, 31)
('Male', 1, 32)
('Male', 1, 35)
('Male', 1, 38)

In [12]:
groupby_Gender_Age=conn.execute('''select Gender,Count(Gender),Age from EmployeeDetails where Age>31 group by Gender;''')
for i in groupby_Gender_Age:
  print(i)

('Female', 1, 32)
('Male', 3, 32)

```
ORDER BY Query

In [ ]:
#by default 'ASC': ascending

In [15]:
groupby_Gender_Age=conn.execute('''select Gender,Count(Gender),Age from EmployeeDetails group by Gender,Age order by Age;''')
for i in groupby_Gender_Age:
  print(i)

('Male', 1, 29)
('Female', 1, 30)
('Male', 1, 30)
('Female', 1, 31)
('Male', 1, 31)
('Female', 1, 32)
('Male', 1, 32)
('Male', 1, 35)
('Male', 1, 38)

In [ ]:
#'DESC' means descending

In [16]:
groupby_Gender_Age=conn.execute('''select Gender,Age from EmployeeDetails group by Gender,Age order by Age desc;''')
for i in groupby_Gender_Age:
  print(i)

('Male', 38)
('Male', 35)
('Female', 32)
('Male', 32)
('Female', 31)
('Male', 31)
('Female', 30)
('Male', 30)
('Male', 29)

In [17]:
groupby_Gender_Age=conn.execute('''select Gender,Count(Age) as Count_Age from EmployeeDetails group by Gender order by Age desc,Count_Age desc;''')
for i in groupby_Gender_Age:
  print(i)

('Male', 6)
('Female', 3)

In [22]:
groupby_Gender_Age=conn.execute('''select * from EmployeeDetails order by 2;''')  #Order By 2 => we can use column numbers instead of column names.
for i in groupby_Gender_Age:
  print(i)

(1004, 'Angela', 'Martin', 31, 'Female')
(1003, 'Dwight', 'Schrute', 29, 'Male')
(1001, 'Jim', 'Halpert', 30, 'Male')
(1009, 'Kevin', 'Malone', 31, 'Male')
(1007, 'Meredith', 'Palmer', 32, 'Female')
(1006, 'Michael', 'Scott', 35, 'Male')
(1002, 'Pam', 'Beasley', 30, 'Female')
(1008, 'Stanley', 'Hudson', 38, 'Male')
(1005, 'Toby', 'Flenderson', 32, 'Male')